Tawank/BruceOS/boards/m5stack-cardputer/sdkconfig.defaults
# M5Stack Cardputer (ESP32-S3, ST7789V2 240x135).
#
# Selected via `python tools/board.py m5stack-cardputer build` (see
# tools/board.py), which passes this file through SDKCONFIG_DEFAULTS after
# the shared sdkconfig.defaults. The build system automatically also loads
# sdkconfig.defaults.esp32s3 if present, per ESP-IDF's target-dependent
# sdkconfig defaults rule.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_swap.csv"

# Run the supported ESP32 targets at their maximum CPU frequency.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHFREQ="80m"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y

# The shell and built-in apps use Wi-Fi interactively, rather than as a
# high-throughput router. Four static RX buffers and four buffers in each
# dynamic pool keep ordinary WPA2, HTTP, and AP traffic responsive while
# avoiding the prior 10/16/16 pools. The AMPDU receive window must not exceed
# the static pool if it is to retain good interoperability.
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=12
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=12
CONFIG_ESP_WIFI_RX_BA_WIN=6
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n

# Management frames are only needed while scanning, associating, or serving
# clients. Do not retain five 500-byte buffers throughout a Wi-Fi session.
# A small dynamic pool still accommodates normal association traffic.
# CONFIG_ESP_WIFI_STATIC_RX_MGMT_BUFFER is not set
CONFIG_ESP_WIFI_DYNAMIC_RX_MGMT_BUFFER=y
CONFIG_ESP_WIFI_RX_MGMT_BUF_NUM_DEF=5

# Display: SPI2_HOST, ST7789V2 135x240 physical panel, landscape (rotation 1).
CONFIG_BRUCE_DISPLAY_WIDTH=135
CONFIG_BRUCE_DISPLAY_HEIGHT=240
CONFIG_BRUCE_DISPLAY_DEFAULT_ROTATION=1
CONFIG_BRUCE_DISPLAY_SPI_HOST=1
CONFIG_BRUCE_DISPLAY_PIN_MOSI=35
CONFIG_BRUCE_DISPLAY_PIN_SCK=36
# The Cardputer ST7789V2 panel supports the ESP32-S3's 80 MHz SPI clock.
CONFIG_BRUCE_DISPLAY_SPI_PCLK_HZ=80000000
CONFIG_BRUCE_DISPLAY_PIN_CS=37
CONFIG_BRUCE_DISPLAY_PIN_DC=34
CONFIG_BRUCE_DISPLAY_PIN_RST=33
CONFIG_BRUCE_DISPLAY_PIN_BL=38

# Audio: I2S DAC.
CONFIG_BRUCE_AUDIO_BACKEND_I2S=y
CONFIG_BRUCE_AUDIO_I2S_BCLK_GPIO=41
CONFIG_BRUCE_AUDIO_I2S_DATA_GPIO=42
CONFIG_BRUCE_AUDIO_I2S_LRCLK_GPIO=43

# Battery.
CONFIG_BRUCE_BATTERY_ENABLED=y
CONFIG_BRUCE_BATTERY_ADC_CHANNEL=9

# SD card: shares the SPI3_HOST radio bus over the Grove port.
CONFIG_BRUCE_SD_ENABLED=y
CONFIG_BRUCE_SD_SPI_HOST=2
CONFIG_BRUCE_SD_PIN_MOSI=14
CONFIG_BRUCE_SD_PIN_MISO=39
CONFIG_BRUCE_SD_PIN_SCK=40
CONFIG_BRUCE_SD_PIN_CS=12

# Buttons: single G0 select button; no A/B/C buttons.
CONFIG_BRUCE_BUTTON_SELECT_ENABLED=y
CONFIG_BRUCE_BUTTON_SELECT_GPIO=0
# CONFIG_BRUCE_BUTTON_A_ENABLED is not set
# CONFIG_BRUCE_BUTTON_B_ENABLED is not set
# CONFIG_BRUCE_BUTTON_C_ENABLED is not set

# Keyboard: 3-output/7-input GPIO scan matrix.
# GPIO1/GPIO2 are shared with peripheral functions, so they must not be used
# as alternate keyboard inputs: a peripheral signal could permanently switch
# the scanner away from the actual keyboard pins.
CONFIG_BRUCE_KEYBOARD_ENABLED=y
CONFIG_BRUCE_KEYBOARD_OUT0_GPIO=8
CONFIG_BRUCE_KEYBOARD_OUT1_GPIO=9
CONFIG_BRUCE_KEYBOARD_OUT2_GPIO=11
CONFIG_BRUCE_KEYBOARD_IN0_GPIO=13
CONFIG_BRUCE_KEYBOARD_IN1_GPIO=15
CONFIG_BRUCE_KEYBOARD_IN2_GPIO=3
CONFIG_BRUCE_KEYBOARD_IN3_GPIO=4
CONFIG_BRUCE_KEYBOARD_IN4_GPIO=5
CONFIG_BRUCE_KEYBOARD_IN5_GPIO=6
CONFIG_BRUCE_KEYBOARD_IN6_GPIO=7
# CONFIG_BRUCE_KEYBOARD_AUTODETECT_ALT is not set

# Infrared.
CONFIG_BRUCE_IR_TX_GPIO=44
CONFIG_BRUCE_IR_RX_GPIO=1

# NRF24: shares the SPI3_HOST radio bus (same pins as the SD card above).
CONFIG_BRUCE_NRF24_SCK_GPIO=40
CONFIG_BRUCE_NRF24_MISO_GPIO=39
CONFIG_BRUCE_NRF24_MOSI_GPIO=14
CONFIG_BRUCE_NRF24_CS_GPIO=1
CONFIG_BRUCE_NRF24_CE_GPIO=2
